---------------------- JOIN 종합 실습문제 ----------------------
-- 1. 직급이 대리이면서 ASIA 지역에 근무하는 직원들의
--    사번, 사원명, 직급명, 부서명, 근무지역명, 급여를 조회하시오
-->> 오라클 전용 구문
-->> ANSI 구문


-- 2. 70년대생이면서 여자이고, 성이 정씨인 직원들의
--   사원명, 주민번호, 부서명, 직급명을 조회하시오
-->> 오라클 전용 구문
-->> ANSI 구문


-- 3. 이름에 '영'자가 들어있는 직원들의 
--    사번, 사원명, 직급명을 조회하시오
-->> 오라클 전용 구문
-->> ANSI 구문


-- 4. 해외영업팀에 근무하는 직원들의
--    사원명, 직급명, 부서코드, 부서명을 조회하시오
-->> 오라클 전용 구문
-->> ANSI 구문


-- 5. 보너스를 받는 직원들의
--    사원명, 보너스, 연봉, 부서명, 근무지역명을 조회하시오
-->> 오라클 전용 구문
-->> ANSI 구문


-- 6. 부서가 있는 직원들의
--    사원명, 직급명, 부서명, 근무지역명을 조회하시오
-->> 오라클 전용 구문
-->> ANSI 구문


-- 7. '한국' 과 '일본' 에 근무하는 직원들의
--    사원명, 부서명, 근무지역명, 근무국가명을 조회하시오
--    단, 이름 기준 가나다순으로 정렬해서 조회
-->> 오라클 전용 구문
-->> ANSI 구문


-- 8. 보너스를 받지 않는 직원들 중 직급코드가 J4 또는 J7 인 직원들의
--    사원명, 직급명, 급여를 조회하시오
-->> 오라클 전용 구문
-->> ANSI 구문


-- 9. 사번, 사원명, 직급명, 급여등급, 구분을 조회하는데
--    이 때, 구분에 해당하는 값은
--    급여등급이 S1, S2 인 경우 '고급'
--    급여등급이 S3, S4 인 경우 '중급'
--    급여등급이 S5, S6 인 경우 '초급' 으로 조회되게 하시오
-->> 오라클 전용 구문
-->> ANSI 구문


-- 10. 각 부서별 총 급여합을 조회하되
--     이 때, 총 급여합이 1000만원 이상인 부서명, 급여합을 조회하시오
-->> 오라클 전용 구문
-->> ANSI 구문


-- 11. 각 부서별 평균급여를 조회하여 부서명, 평균급여 (정수처리) 로 조회하시오
--     단, 부서배치가 안된 사원들의 평균도 같이 나오게끔 하시오
-->> 오라클 전용 구문
-->> ANSI 구문


-- 12. 2010년 이후 입사한 '이'씨 성을 가진 사원의 사원 코드, 사원 명, 부서명 조회
-->> 오라클 전용 구문
-->> ANSI 구문


-- 13. 부서 코드가 D5이거나 D6인 사원의 사원 명, 직급코드, 부서 코드, 부서 명 조회
-->> 오라클 전용 구문
-->> ANSI 구문


-- 14. 직급이 '과장' 인 사원들의 사번, 사원 명, 직급 명, 급여, 입사일 조회
-->> 오라클 전용 구문
-->> ANSI 구문


-- 15. 70년대 생(1970~1979) 인 사원의 이름과, 주민번호, 부서명 조회
-->> 오라클 전용 구문
-->> ANSI 구문


-- 16. 부서 배치가 되지 않은 사원들의 사원명, 급여, 부서명 ("미정") 으로 조회
-->> 오라클 전용 구문
-->> ANSI 구문


-- 17. 성별이 남자인 사원들의 사번, 사원 명, 부서 명, 직급 명, 급여, 입사일 조회
-->> 오라클 전용 구문
-->> ANSI 구문





